app/controllers/categories_controller.rb

  def create
    @category = Category.new(category_params)

    if @category.save
---
INSERT INTO "categories" ("name", "created", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "some category"], ["created", "standard"], ["created_at", "2020-11-21 18:39:16.902471"], ["updated_at", "2020-11-21 18:39:16.902471"]]

  def update
    if @category.update(category_params)
---
UPDATE "categories" SET "created" = $1, "updated_at" = $2 WHERE "categories"."id" = $3  [["created", "standard"], ["updated_at", "2020-11-21 18:36:17.303131"], ["id", 1]]