app/controllers/questions_controller.rb

  def create
    @question = @category.questions.build(question_params)
    # @question = Question.new(question_params)
    # @question.category_id = params[:category_id]

    # creates new question for the category, but throws error:
    # NoMethodError (undefined method `question_url' at line 28
    # https://api.rubyonrails.org/classes/ActionController/Redirecting.html#method-i-redirect_to
    if @question.save
---
INSERT INTO "questions" ("quiz_question", "correct_answer", "incorrect_answer_1", "incorrect_answer_2", "incorrect_answer_3", "category_id", "created_at", "updated_at", "user_answer") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"

  def update
    if @question.update(question_params)
---
UPDATE "questions" SET "correct_answer" = $1, "updated_at" = $2 WHERE "questions"."id" = $3  [["correct_answer", "answer2"], ["updated_at", "2020-11-23 23:07:43.073273"], ["id", 11]]

    def get_category
      @category = Category.find(params[:category_id])
---
SELECT "categories".* FROM "categories" WHERE "categories"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

    def set_question
      @question = @category.questions.find(params[:id])
---
SELECT "questions".* FROM "questions" WHERE "questions"."category_id" = $1 AND "questions"."id" = $2 LIMIT $3  [["category_id", 1], ["id", 11], ["LIMIT", 1]]